app/Controllers/Admin.php

    public function logar()
    {
        if (!$this->request->is('post')) {
            redirect()->to('/admin');
        }

        $contaValida = $this->validate([
            'email' => 'required|valid_email',
            'senha' => 'required|min_length[8]',
        ], [
            'email' => [
                'required' => 'O campo do Email é requerido',
                'valid_email' => 'Email inválido',
            ],
            'senha' => [
                'required' => 'O campo da senha é obrigatório',
                'min_length' => 'O minimo de caracteres para a senha  é 8',
            ],
        ]);
        // dd($this->request->getPost());

        if (!$contaValida) {
            return redirect()->to('/admin')->with('errors', $this->validator->getErrors())->withInput();
        }

        $admin = $this->request->getPost();
        $adminBanco = $this->adminModel->select('nome,email,senha')->where('email', $admin['email'])->first();
---
SELECT `nome`, `email`, `senha`
FROM `admins`
WHERE `email` = 'chrislan06@gmail.com'
 LIMIT 1

    public function cadastrar()
    {
        if (!$this->request->is('post')) {
            return redirect()->to('/');
        }

        $params = $this->request->getPost();


        try {
            $usuario = new UsuarioEntity($params);
            if (!$usuario->usuarioValido()) {
                throw new InvalidArgumentException();
            }
            $data = [
                'nome' => $usuario->nome,
                'email' => $usuario->email,
                'senha' => $usuario->hashSenha(),
            ];

            // dd($this->usuarioModel->errors() !== null);
            $resultado = $this->usuarioModel->insert($data);
---
INSERT INTO `usuarios` (`nome`, `email`, `senha`, `criado_em`, `atualizado_em`) VALUES ('lucas viana', 'lvd6612530@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$enM3b0ZGSDAwZEJ5UmFOZA$qu3aQh38tULZ2ZKlCv/Oq4i40ursXC0g8LlWTB/GDLo', '2023-05-20 20:43:39', '2023-05-20 20:43:39')