app/Controllers/Cliente.php

    public function cadastrar()
    {
        if (!$this->request->is('post')) {
            return redirect()->to('/');
        }

        $params = $this->request->getPost();
        $params['dataNascimento'] = new DateTime($params['dataNascimento']);
        // dd($params);


        try {
            $cliente = new ClienteEntity($params);

            if (count($cliente->messages) > 0){
                throw new InvalidArgumentException();
            }

            $data = [
                'nome' => $cliente->nome,
                'rg' => $cliente->rg,
                'cpf' => $cliente->getCPF(),
                'data_nascimento' => $cliente->getDataNascimento()
            ];

            // dd($data);

            $resultado = $this->clienteModel->insert($data);
---
INSERT INTO `clientes` (`nome`, `rg`, `cpf`, `data_nascimento`, `criado_em`, `atualizado_em`) VALUES ('lucas viana', '12345678901122', '035.257.493-33', '2003-03-14 00:00:00', '2023-05-20 20:50:18', '2023-05-20 20:50:18')