app/Controllers/Login.php

    public function logar()
    {
        // Verificar se foi mandando no metodo POST
        if (!$this->request->is('post')) {
            return redirect()->to('/');
        }


        // validar os campos enviados
        try {
            $usuario = new UsuarioEntity($this->request->getPost());

            if (!$usuario->usuarioValido()) {
                throw new InvalidArgumentException();
            }

            $usuarioBanco = $this->usuarioModel->where('email', $usuario->email)->select('id,nome,email,senha')->first();
---
SELECT `id`, `nome`, `email`, `senha`
FROM `usuarios`
WHERE `email` = 'Chrislan@gmail.com'
 LIMIT 1